gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    // Go back to the start of the directory
    rewinddir(directory);

    int i = 0;
    bpk_swap_address(Bpacket);
    Bpacket->Code          = BPK_Code_In_Progress;
    Bpacket->Data.numBytes = BPACKET_MAX_NUM_DATA_BYTES;
    int in                 = FALSE; // Variable just to know whether there was anything or not
    while ((dirPtr = readdir(directory)) != NULL) {
        in = 1;
        // Copy the name of the folder into the folder structure string
        int k = 0;
        while (dirPtr->d_name[k] != '\0') {
            Bpacket->Data.bytes[i++] = dirPtr->d_name[k];

            if (i == BPACKET_MAX_NUM_DATA_BYTES) {
                esp32_uart_send_bpacket(Bpacket);
                i = 0;
            }

            k++;
        }

        Bpacket->Data.bytes[i++] = '\r';

        if (i == BPACKET_MAX_NUM_DATA_BYTES) {
            esp32_uart_send_bpacket(Bpacket);
            i = 0;
        }

        Bpacket->Data.bytes[i++] = '\n';

        if (i == BPACKET_MAX_NUM_DATA_BYTES) {
            esp32_uart_send_bpacket(Bpacket);
            i = 0;
        }
    }

    if (i != 0) {
        Bpacket->Code          = BPK_Code_Success;
        Bpacket->Data.numBytes = i;
        esp32_uart_send_bpacket(Bpacket);
    }

    if (in == FALSE) {
        bp_convert_to_response(Bpacket, BPK_Code_Success, 0, NULL);
        esp32_uart_send_bpacket(Bpacket);
    }

    closedir(directory);
    sd_card_close();

    return TRUE;
}

uint8_t sd_card_write_to_file(char* filePath, char* string, bpk_packet_t* Bpacket) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "SD Card could not open\0");
        return FALSE;
    }

    // Validate the path length
    if (chars_get_num_bytes(filePath) > MAX_PATH_LENGTH) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Filepath > 50 characters\0");
        return FALSE;
    }

    // Add SD card mount point to start of path
    char directory[MAX_PATH_LENGTH + 9];
    sprintf(directory, "%s/%s", MOUNT_POINT_PATH, filePath);

    if (sd_card_create_path(directory, Bpacket) != TRUE) {
        return FALSE;
    }

    // Try open the file
    FILE* file = fopen(directory, "a+");

    if (file == NULL) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Filepath could not open\0");
        return FALSE;
    }

    fprintf(file, string);
    fclose(file);

    bp_convert_to_response(Bpacket, BPK_Code_Success, 0, NULL);
    return TRUE;
}

uint8_t sd_card_search_num_images(uint16_t* numImages, bpk_packet_t* Bpacket) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    // Confirm the directory for the images exists
    if (sd_card_create_path(IMAGE_DATA_FOLDER, Bpacket) != TRUE) {
        return FALSE;
    }

    // Open the directory where the images are stored
    DIR* directory;
    directory = opendir(ROOT_IMAGE_DATA_FOLDER);
    if (directory == NULL) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Img dir could not open\0");
        return FALSE;
    }

    // Loop through each file and calculate the number of images
    struct dirent* dirPtr;
    *numImages = 0;
    while ((dirPtr = readdir(directory)) != NULL) {
        // Checking both img and IMG just incase as SD card is weird when it comes allowing/not allowing
        // lower case letters
        if (chars_contains(dirPtr->d_name, "img") == TRUE || chars_contains(dirPtr->d_name, "IMG") == TRUE) {
            *numImages += 1;
        }
    }

    return TRUE;
}

uint8_t sd_card_get_maximum_storage_capacity(uint16_t* maxStorageCapacityMb) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    *maxStorageCapacityMb = (card->csd.capacity * card->csd.sector_size) / (1024 * 1024);

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_add_temp_to_csv(dt_datetime_t Datetime, cdt_double16_t Temp1, cdt_double16_t Temp2) {

    FILE* excelFile;
    if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "r")) == NULL) {
        if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "w")) == NULL) {
            printf("Probelm creating the csv file");
            return FALSE;
        }
        fprintf(excelFile, "Date, Time, Temp 1, Temp 2");
    } else {
        fclose(excelFile);
        if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "a")) == NULL) {
            printf("Probelm opeing the csv file");
            return FALSE;
        }
    }
    char timeString[10];
    dt_time_to_string(timeString, Datetime.Time, TRUE);
    fprintf(excelFile, "\r%i/%i/%i, %s, %s%i.%i, %s%i.%i", Datetime.Date.day, Datetime.Date.month, Datetime.Date.year,
            timeString, Temp1.info == 0 ? "" : "-", Temp1.integer, Temp1.decimal, Temp2.info == 0 ? "" : "-",
            Temp2.integer, Temp2.decimal);

    fclose(excelFile);

    return TRUE;
}

uint8_t sd_card_save_image(uint8_t* imageData, int imageLength, bpk_packet_t* Bpacket) {

    // Extract the RTC and temperatre data from the Bpacket
    cdt_double16_t Temp1, Temp2;
    dt_datetime_t DateTime;
    uint8_t result = wd_bpacket_to_photo_data(Bpacket, &DateTime, &Temp1, &Temp2);

    if (result != TRUE) {
        char err[50];
        wd_get_error(result, err);
        bp_create_string_response(Bpacket, BPK_Code_Error, err);
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Could not open the SD card\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    // // Create the data folder path if required
    // if (sd_card_create_path(IMAGE_DATA_FOLDER, Bpacket) != TRUE) {
    //     bpacket_create_sp(Bpacket, sender, Receiver, Request, BPK_Code_Error,
    //                       "Could not create path to data folder\0");
    //     esp32_uart_send_bpacket(Bpacket);
    //     return FALSE;
    // }

    // Create formatted image number in the format of xxx
    char imgNumString[8];
    sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

    // Create formatted date time in the format yymmdd_hhmm
    char datetimeString[40];
    sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", DateTime.Date.year - 2000, DateTime.Date.month < 10 ? "0" : "",
            DateTime.Date.month, DateTime.Date.day < 10 ? "0" : "", DateTime.Date.day,
            DateTime.Time.hour < 10 ? "0" : "", DateTime.Time.hour, DateTime.Time.minute < 10 ? "0" : "",
            DateTime.Time.minute);

    // Create path for image
    char filePath[80];
    sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, IMAGE_DATA_FOLDER, imgNumString, datetimeString);

    FILE* imageFile = fopen(filePath, "wb");
    if (imageFile == NULL) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Image file failed to open\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

