gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    for (int i = 0; i < imageLength; i++) {
        fputc(imageData[i], imageFile);
    }

    fclose(imageFile);

    imageNumber++;

    // Save the temperature data
    if (sd_card_add_temp_to_csv(DateTime, Temp1, Temp2) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "Failed to save temperature data\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    return TRUE;
}

uint8_t sd_card_init(bpk_packet_t* Bpacket) {

    // Update the image number
    if (sd_card_search_num_images(&imageNumber, Bpacket) != TRUE) {
        return FALSE;
    }

    return TRUE;
}

void sd_card_copy_file(bpk_packet_t* Bpacket, bpacket_char_array_t* bpacketCharArray) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\0");
        esp32_uart_send_bpacket(Bpacket);
        return;
    }

    // Return an error if there was no specified file
    if (bpacketCharArray->string[0] == '\0') {
        bp_create_string_response(Bpacket, BPK_Code_Error, "No file was specified\0");
        esp32_uart_send_bpacket(Bpacket);
        return;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(bpacketCharArray->string);

    if (filePathNameSize > (57)) { // including mount point which is current 7 bytes
        bp_create_string_response(Bpacket, BPK_Code_Error, "File path > 50\0");
        esp32_uart_send_bpacket(Bpacket);
        return;
    }

    char filePath[filePathNameSize + 1]; // add one for null pointer!
    sprintf(filePath, "%s%s", MOUNT_POINT_PATH, bpacketCharArray->string);
    int i = 0;
    for (i = 0; i < filePathNameSize; i++) {
        filePath[i + 8] = bpacketCharArray->string[i];
    }
    filePath[i + 8] = '\0'; // Add null terminator

    // Get the length of the file
    uint32_t fileNumBytes;
    char errMsg[50];
    if (sd_card_get_file_size(filePath, &fileNumBytes, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        sd_card_close();
        return;
    }

    FILE* file;
    if (sd_card_open_file(&file, filePath, SD_CARD_FILE_READ, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        sd_card_close();
        return;
    }

    // Change the values of the Bpacket so they get sent to Maple
    bpk_swap_address(Bpacket);
    Bpacket->Code          = BPK_Code_In_Progress;
    Bpacket->Data.numBytes = BPACKET_MAX_NUM_DATA_BYTES;
    int pi                 = 0;

    for (uint32_t i = 0; i < fileNumBytes; i++) {

        Bpacket->Data.bytes[pi++] = fgetc(file);

        if (pi < BPACKET_MAX_NUM_DATA_BYTES && (i + 1) != fileNumBytes) {
            continue;
        }

        if ((i + 1) == fileNumBytes) {
            Bpacket->Code          = BPK_Code_Success;
            Bpacket->Data.numBytes = pi--;
        }

        esp32_uart_send_bpacket(Bpacket);

        pi = 0;
    }

    fclose(file);

    // Close the SD card
    sd_card_close();
}

uint8_t sd_card_write_settings(bpk_packet_t* Bpacket) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    FILE* file;
    char errMsg[50];
    if (sd_card_open_file(&file, SETTINGS_FILE_PATH_START_AT_ROOT, SD_CARD_FILE_WRITE, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        sd_card_close();
        return FALSE;
    }

    switch (Bpacket->Request.val) {

        case BPK_WD_REQUEST_SET_CAMERA_SETTINGS:;

            wd_camera_settings_t cameraSettings;
            if (wd_bpacket_to_camera_settings(Bpacket, &cameraSettings) != TRUE) {
                bp_create_string_response(Bpacket, BPK_Code_Error, "Bpacket to camera settings failed\0");
                esp32_uart_send_bpacket(Bpacket);
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            fseek(file, 0L, SEEK_SET); // Ensure the file is pointing to first byte
            fputc(cameraSettings.resolution, file);

            break;

        case BPK_WD_REQUEST_SET_CAPTURE_TIME_SETTINGS:;

            wd_camera_capture_time_settings_t captureTime;
            if (wd_bpacket_to_capture_time_settings(Bpacket, &captureTime) != TRUE) {
                bp_create_string_response(Bpacket, BPK_Code_Error,
                                          "Bpacket to capture time settings failed. SD Card write attempt\r\n\0");
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            // Skip the first byte as this is where the camera resolution is stored
            fseek(file, 1, SEEK_CUR);
            fputc(captureTime.startTime.minute, file);
            fputc(captureTime.startTime.hour, file);
            fputc(captureTime.endTime.minute, file);
            fputc(captureTime.endTime.hour, file);
            fputc(captureTime.intervalTime.minute, file);
            fputc(captureTime.intervalTime.hour, file);

            break;

        default:;

            bp_create_string_response(Bpacket, BPK_Code_Error, "WF: Invalid Request!\r\n\0");
            esp32_uart_send_bpacket(Bpacket);
            return FALSE;
    }

    // Clean up
    fclose(file);
    sd_card_close();

    // Update Bpacket to send as success response back
    bpk_swap_address(Bpacket);
    Bpacket->Data.numBytes = 0;
    Bpacket->Code          = BPK_Code_Success;

    return TRUE;
}

uint8_t sd_card_format_sd_card(bpk_packet_t* Bpacket) {

    char errMsg[50];

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
        return FALSE;
    }

