gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    /****** START CODE BLOCK ******/
    // Description: Confirm all the correct folders on the SD card exist

    // Create watchdog folder if necessary
    if (sd_card_create_path(WATCHDOG_FOLDER_PATH, Bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create data folder if necessary
    if (sd_card_create_path(DATA_FOLDER_PATH, Bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create logs folder if necessary
    if (sd_card_create_path(LOG_FOLDER_PATH, Bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create settings folder if necessary
    if (sd_card_create_path(SETTINGS_FOLDER_PATH, Bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    /****** END CODE BLOCK ******/

    /****** START CODE BLOCK ******/
    // Description: Confirm the settings file exists and that it has valid data

    // Create the settings file if required
    if (sd_card_create_file(SETTINGS_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    uint32_t numBytes = 0;

    // Write default settings to settings file the file is empty
    if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &numBytes, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        sd_card_close();
        return FALSE;
    }

    if (numBytes == 0) {

        // Write the default camera settings to the SD card
        bpk_packet_t cSettings;
        if (wd_camera_settings_to_bpacket(&cSettings, Bpacket->Receiver, Bpacket->Sender,
                                          BPK_WD_Request_Set_Camera_Settings, BPK_Code_Execute,
                                          &deafultCameraSettings) != TRUE) {
            bp_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default camera settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        if (sd_card_write_settings(&cSettings) != TRUE) {
            bp_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default camera settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        // Write the default capture time settings to the SD card
        bpk_packet_t ctSettings;
        if (wd_capture_time_settings_to_bpacket(&ctSettings, Bpacket->Receiver, Bpacket->Sender,
                                                BPK_WD_Request_Set_Capture_Time_Settings, BPK_Code_Execute,
                                                &defaultCaptureTimeSettings) != TRUE) {
            bp_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default capture time settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        if (sd_card_write_settings(&ctSettings) != TRUE) {
            bp_create_string_response(Bpacket, BPK_Code_Error, "Settings default capture time settings failed\r\n\0");
            sd_card_close();
            return FALSE;
        }
    }

    /****** END CODE BLOCK ******/

    /****** START CODE BLOCK ******/
    // Description: Confirm the log and data files exist

    // Create the data file if required
    if (sd_card_create_file(DATA_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        return FALSE;
    }

    // Create the logs file if required
    if (sd_card_create_file(LOG_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        return FALSE;
    }

    /****** END CODE BLOCK ******/

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_read_settings(bpk_packet_t* Bpacket) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
        return FALSE;
    }

    // Confirm the file path to the settings exists
    if (sd_card_create_path(SETTINGS_FOLDER_PATH, Bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Get the file size of the settings file. This needs to be done first because the file
    // needs to be opened in read mode
    uint32_t fileNumBytes = 0;
    char errMsg[50];
    if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &fileNumBytes, errMsg) != TRUE) {
        bp_create_string_response(Bpacket, BPK_Code_Error, errMsg);
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    if (fileNumBytes == 0) {

        switch (Bpacket->Request.val) {

            case BPK_WD_REQUEST_GET_CAMERA_SETTINGS:;

                bpk_packet_t camSettingsBpacket;
                if (wd_camera_settings_to_bpacket(&camSettingsBpacket, Bpacket->Receiver, Bpacket->Sender,
                                                  BPK_WD_Request_Set_Camera_Settings, BPK_Code_Execute,
                                                  &deafultCameraSettings) != TRUE) {
                    bp_create_string_response(Bpacket, BPK_Code_Error, "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(Bpacket);
                    return FALSE;
                }

                if (sd_card_write_settings(&camSettingsBpacket) != TRUE) {
                    bp_create_string_response(Bpacket, BPK_Code_Error, "Failed to write settings\r\n\0");
                    esp32_uart_send_bpacket(Bpacket);
                }
                break;

            case BPK_WD_REQUEST_GET_CAPTURE_TIME_SETTINGS:;

                bpk_packet_t deafultCaptureTimeSettingsBpacket;

                if (wd_capture_time_settings_to_bpacket(&deafultCaptureTimeSettingsBpacket, Bpacket->Receiver,
                                                        Bpacket->Sender, Bpacket->Request, BPK_Code_Execute,
                                                        &defaultCaptureTimeSettings) != TRUE) {
                    bp_create_string_response(Bpacket, BPK_Code_Error, "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(Bpacket);
                    return FALSE;
                }

                sd_card_write_settings(&deafultCaptureTimeSettingsBpacket);

                break;

